// ------------------------Part 1------------------------
function foo(x=5){
    let x=1;//-----------报错，和foo里面重了
    const x=1;//-----------报错，和上面重了
    var x=1;//-----------正常，就是覆盖了嘛
}
foo();

// ------------------------Part 2------------------------
/*
默认值顺序，参数一般有顺序，有默认值的参数应该是尾参数
否则无法使用有默认值的默认值，没有默认值的用传递的参数
*/
function f(x=1,y){
    return [x,y];
}
f();//[1,undefined]
f(2);//[2,undefined]
// f(,3);报错，无法使x用1，y用3

// 所以有默认值的参数在最后
function f(x,y=1){
    return [x,y];
}
f();//[undefined 1]
f(2);//[2,1]-------这样就可以x为传递的参数，y为默认的值